In [73]:
import pandas as pd

In [74]:
import numpy as np

In [75]:
data = pd.read_csv("economy.csv")
data

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"
...,...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,UK,832,07:05,Chennai,13h 50m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"7,697"
206770,31-03-2022,Vistara,UK,832,07:05,Chennai,13h 50m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"7,709"
206771,31-03-2022,Vistara,UK,826,12:30,Chennai,20h 35m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,09:05,Hyderabad,"8,640"
206772,31-03-2022,Vistara,UK,822,09:45,Chennai,23h 20m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,09:05,Hyderabad,"8,640"
206773,31-03-2022,Vistara,UK,824,20:30,Chennai,24h 25m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"8,640"

In [76]:
# inputs : date + airline + dep_time + from + to 
# outputs : price + time_taken + arr_time

In [77]:
data.drop(columns=['stop'] , inplace=True)

In [78]:
data.drop(columns= ['ch_code'] , inplace=True)

In [79]:
data.drop(columns= ['num_code'] , inplace=True)

In [80]:
data

,date,airline,dep_time,from,time_taken,arr_time,to,price
0,11-02-2022,SpiceJet,18:55,Delhi,02h 10m,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,06:20,Delhi,02h 20m,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,04:25,Delhi,02h 10m,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,10:20,Delhi,02h 15m,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,08:50,Delhi,02h 20m,11:10,Mumbai,"5,955"
...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,07:05,Chennai,13h 50m,20:55,Hyderabad,"7,697"
206770,31-03-2022,Vistara,07:05,Chennai,13h 50m,20:55,Hyderabad,"7,709"
206771,31-03-2022,Vistara,12:30,Chennai,20h 35m,09:05,Hyderabad,"8,640"
206772,31-03-2022,Vistara,09:45,Chennai,23h 20m,09:05,Hyderabad,"8,640"
206773,31-03-2022,Vistara,20:30,Chennai,24h 25m,20:55,Hyderabad,"8,640"

In [81]:
data["from"].unique()

<StringArray>
['Delhi', 'Mumbai', 'Bangalore', 'Kolkata', 'Hyderabad', 'Chennai']
Length: 6, dtype: str

In [83]:
MyD = pd.read_csv("geodist_PSW24.csv")
MyD

,countrycode_1,countrycode_2,avg_distance_km,avg_distance_norm,border,latitudinal_distance,longitudinal_distance,area,area_imputed
0,AND,AND,6.573193,0.000328,0,0.036363,0.054022,468.0,0
1,AND,ARE,5236.319300,0.261326,0,17.602310,53.658913,NaN,0
2,AND,AFG,5690.470700,0.283991,0,7.920643,66.367470,NaN,0
3,AND,ATG,6563.002900,0.327536,0,25.397484,63.369312,NaN,0
4,AND,AIA,6588.133800,0.328790,0,24.315380,64.612717,NaN,0
...,...,...,...,...,...,...,...,...,...
60020,ZWE,YEM,4027.593500,0.201003,0,33.255863,14.447050,NaN,0
60021,ZWE,MYT,1729.058100,0.086291,0,5.965743,14.907459,NaN,0
60022,ZWE,ZAF,1217.009200,0.060737,1,10.092901,3.960009,NaN,0
60023,ZWE,ZMB,621.100770,0.030997,1,4.767350,2.304927,NaN,0
60024,ZWE,ZWE,255.902480,0.012771,0,1.486419,1.667999,390580.0,0

In [87]:
MyD.drop(columns= ["avg_distance_norm" , "border", "latitudinal_distance", "longitudinal_distance","area","area_imputed"], inplace=True)
MyD

KeyError: "['avg_distance_norm', 'border', 'latitudinal_distance', 'longitudinal_distance', 'area', 'area_imputed'] not found in axis"

In [97]:
MyD["countrycode_1"].unique()

<StringArray>
['AND', 'ARE', 'AFG', 'ATG', 'AIA', 'ALB', 'ARM', 'AGO', 'ARG', 'ASM',
 ...
 'VNM', 'VUT', 'WLF', 'WSM', 'XKX', 'YEM', 'MYT', 'ZAF', 'ZMB', 'ZWE']
Length: 245, dtype: str

In [113]:
code = pd.read_csv("wikipedia-iso-country-codes.csv")
code.drop(columns=["Alpha-2 code","Numeric code","ISO 3166-2"],inplace=True)
code

    English short name lower case Alpha-3 code
0                     Afghanistan          AFG
1                   Åland Islands          ALA
2                         Albania          ALB
3                         Algeria          DZA
4                  American Samoa          ASM
..                            ...          ...
241             Wallis and Futuna          WLF
242                Western Sahara          ESH
243                         Yemen          YEM
244                        Zambia          ZMB
245                      Zimbabwe          ZWE

[246 rows x 2 columns]

In [114]:
code

    English short name lower case Alpha-3 code
0                     Afghanistan          AFG
1                   Åland Islands          ALA
2                         Albania          ALB
3                         Algeria          DZA
4                  American Samoa          ASM
..                            ...          ...
241             Wallis and Futuna          WLF
242                Western Sahara          ESH
243                         Yemen          YEM
244                        Zambia          ZMB
245                      Zimbabwe          ZWE

[246 rows x 2 columns]